test/cfmeshJet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        
        solver          GAMG;//PCG;
        smoother        nonBlockingGaussSeidel ;//symGaussSeidel;
        //preconditioner  DIC;
        tolerance       1e-09;
        relTol          0.00051;
    }

    h
    {
        solver          PBiCG; //BICCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0.00051;
    }


    hFinal
    {
	    $h;
        relTol          0;
    }


    pFinal
    {
	    $p;
        //relTol          0;
    }


    "rho.*"
    {
	    $p;
        tolerance       1e-08;
        relTol          0;
    }


    "(U|R|k|omega)"
    {
        solver          PBiCGStab; //BICCG;
        preconditioner  DILU;
        //solver          smoothSolver;
        //smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.01;
    }

    "(U|R|k|omega)Final"
    {
	$U;
        relTol          0;
    }
}

PIMPLE
{

    momentumPredictor		yes;
    nOuterCorrectors     	1;		
    nCorrectors 		2;
    nNonOrthogonalCorrectors 	1;


//    rhoMin 	rhoMin [1 -3 0 0 0] 0.5;	
//    rhoMax 	rhoMax [1 -3 0 0 0] 2.0;
}




// ************************************************************************* //
