test/cfmeshJet/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "geometry/jet/join.stl";

minCellSize 0.1e-3;
maxCellSize 1e-3;

//boundaryCellSize 0.1;

checkForGluedMesh 0;

/*keepCellsIntersectingPatches
{
    container
    {
        KeepCells 0;
    }
}*/

localRefinement
{
    
    "(container|elec.*)"
    {
        cellSize  0.05e-3;
    }
}

objectRefinements
{
    cavity
    {
        type cone;
        cellSize 0.1e-3;
        p0  (0 0 -2e-3);
        p1  (0 0 3e-3);
        radius0  2e-3;
        radius1  2e-3;
        refinementThickness 1e-3;
       
    }

    cone //semi aperture angle 30 deg
    {
        type cone;
        cellSize 0.5e-3;
        p0  (0 0 2e-3);
        p1  (0 0 51e-3);
        radius0  2e-3;
        radius1  30e-3;
        refinementThickness 2e-3;
    }
}

boundaryLayers
{
    //nLayers     0;

    patchBoundaryLayers
    {

        "(container|elec.*)"
        {
             nLayers    3;
             thicknessRatio     1.2;

        }

        /*plane
        {   
            nLayers     3;
            thicknessRatio  1.2;
            allowDiscontinuity  1;
        }*/
    }

    optimiseLayer 1;

    optimisationParameters
    {
        nSmoothNormals      5;
        relThicknessTol     0.15;
        featureSizeFactor   0.3;
        reCalculateNormals  1;
        maxNumIterations    5;
    }
}

workflowControls
{
    //stopAfter edgeExtraction;
}
renameBoundary
{
    //defaultName     fixedWalls;
    defaultType     wall;

    newPatchNames
    {
        
        "outlet.*"
        {
            type    patch;
            newName outlet;
        }

        "(plane|container|elec.*)"
        {
            type    wall;
            newName wall;
        }
    }
}
// ************************************************************************* //
