test/cfmeshJet/system/phase_ave
phase_ave
     {
         type                    fieldAverage;
         functionObjectLibs ( "libfieldFunctionObjects.so" );
         enabled                true;
         outputControl        outputTime;
 
         fields
         (
             U
             {
                 mean          on;
                 prime2Mean  off;
                 base           time;
             }

         );
    }
