test/cfmeshJet/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 298
    volScalarFieldValue p 1e5
);

regions
(
    // Set cell values
    // (does zerogradient on boundaries)
    /*zoneToCell
    {
        zone cavity;
        fieldValues
        (
            volScalarFieldValue T 7500
            volScalarFieldValue p 1e6
        );
    }*/

    cylinderToCell
    {
        radius 5e-4;
        
        p1 (-0.001 0 0);
        p2 (0.001 0 0);
        //p1 (-0.001 0 -4.5e-3);
        //p2 (0.001 0 -4.5e-3);
        
        fieldValues
        (
            volScalarFieldValue T 7500
            volScalarFieldValue p 1e6
        );
    }
);

// ************************************************************************* //
