test/cfmeshJet/system/volFieldValue1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/


volFieldValue1
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             true;
        writeControl    writeTime;
        writeFields     true;

        regionType      cellZone;
        name            cavity;
        operation       volAverage;


        fields
        (
            
            T
	   
        );
    }


// ************************************************************************* //
